/*
 * Toshiba TZ3000 Ethernet controller driver
 *
 * Copyright (C) 2010,2013,2014 Toshiba Corporation
 *
 * SPDX-License-Identifier:	GPL-2.0+
 */

#include <config.h>
#include <common.h>
#include <malloc.h>
#include <net.h>
#include <netdev.h>
#include <asm/errno.h>
#include <asm/io.h>
#include <asm/processor.h>
#include <miiphy.h>

/* independent from SWAP_IO_SPACE */
#ifdef EMAC_ETH_DEBUG_IO
static inline u32 emac_readl(void *addr)
{
	u32 ret = __raw_readl(addr);
	printf("EMAC_read (0x%08x) -> 0x%08x\n", (u32)addr, ret);
	return ret;
}

static inline void emac_writel(u32 d, void *addr)
{
	__raw_writel(d, addr);
	printf("EMAC_write(0x%08x) <- 0x%08x\n", (u32)addr, d);
}
#else
#define emac_readl(addr)	__raw_readl(addr)
#define emac_writel(d, addr)	__raw_writel(d, addr)
#endif

#define EMAC_NAME		"tz3000"
#define MII_IO_TIMEOUT		1000
#define EMAC_MSG_FLAG		(NETIF_MSG_TX_ERR|NETIF_MSG_DRV|NETIF_MSG_LINK)

#define RX_DESC_NUM		5
#define TX_DESC_NUM		5
#define TX_BUF_SIZE		1536
#define RX_BUF_SIZE		1536

#define ETH_FRAME_LEN		1536
/* mdiocycr: (200ns / (1000000000 / TZ3000_EMAC_BUSCLK) - 1) */
#define MDIOCYCR_SET	(((TZ3000_EMAC_BUSCLK + 5000000 - 1) / 5000000) - 1)

#define TZ3000_EMAC_MAX_WAIT	CONFIG_SYS_HZ	/* 1 sec for get_timer() */
#define TZ3000_ETH_MS_WAIT	TZ3000_EMAC_MAX_WAIT/1000
#define TRANSMIT_TIMEOUT	1 * TZ3000_EMAC_MAX_WAIT
#define AUTONEG_TIMEOUT		5 * TZ3000_EMAC_MAX_WAIT
#define READ_TIMEOUT		1 * TZ3000_EMAC_MAX_WAIT
#define FIFO_TIMEOUT		1 * TZ3000_EMAC_MAX_WAIT
#define DMA_TIMEOUT		1 * TZ3000_EMAC_MAX_WAIT

/* phy address */
#define TZ3000_PHY_ADDR	CONFIG_TZ3000_PHY_ADDR
/* Base address */
#define EMAC_IOBASE_ADDR	TZ3000_EMAC_BASE

#define NET_SKB_PAD		0
#define NET_IP_ALIGN		0

/* ERROR */
#define EREAD			1
#define EAUTONEG		2
#define EPHYRESET		3

struct emac_eth_options {
	int tx_desc_num;
	int rx_desc_num;
};

struct emac_eth_dev {
	struct tx_desc_s *tx_desc_base;
	struct tx_desc_s *tx_desc_dma_base;
	struct rx_desc_s *rx_desc_base;
	struct rx_desc_s *rx_desc_dma_base;

	unsigned int txdesc;
	unsigned int rxdesc;

	u32 *rx_buf_dma_base;
	u32 *rx_buf_base;
	u8 mac_addr[6];
	u8 phy_addr;
	struct eth_device *dev;

};

/* Register Map */
struct emac_eth_regs {
	u32 emacdrr;		/* 0x0000 */
	u32 emacdrtrgr;		/* 0x0004 */
	u32 emacdrenr;		/* 0x0008 */
	u32 reserved00[5];	/* 0x000c - 0x001F */
	u32 emacintr;		/* 0x0020 */
	u32 emacintenr;
	u32 emacintdcr;
	u32 reserved00_1[51];
	u32 emacfinfr;
	u32 reserved01[961];
	u32 dmacr;		/* 0x1000 */
	u32 reserved02[1];
	u32 dmatxr;
	u32 reserved03[1];
	u32 dmarxr;
	u32 reserved04[5];
	u32 dmaintr;
	u32 reserved05[1];
	u32 dmaintenr;
	u32 reserved06[1];
	u32 errmskr;
	u32 reserved07[1];
	u32 rxmiscntr;
	u32 reserved08[1];
	u32 txfifothr;
	u32 reserved09[1];
	u32 fifosizer;
	u32 reserved10[1];
	u32 dmarxmodr;
	u32 reserved11[1];
	u32 rxpadr;
	u32 reserved12[1];
	u32 rxfifothr;
	u32 reserved12_1[5];
	u32 txfifostsr;
	u32 reserved12_2[1];
	u32 rxfifostsr;
	u32 reserved13[29];
	u32 maccr;		/* 0x1100 */
	u32 reserved14[1];	/* 0x1104 */
	u32 lenlmtr;		/* 0x1108 */
	u32 reserved15[1];	/* 0x110c */
	u32 macintr;		/* 0x1110 */
	u32 reserved16[1];	/* 0x1114 */
	u32 macintenr;		/* 0x1118 */
	u32 reserved17[4];	/* 0x111c - 0x1128 */
	u32 phyintr;		/* phyintr: 0x112c */
	u32 reserved17_1[1];	/* 0x1130 */
	u32 rgibsr;		/* 0x1134 */
	u32 macstsr;		/* 0x1138 */
	u32 reserved17_2[1];	/* 0x113c */
	u32 phyifr;		/* 0x1140 */
	u32 reserved18_1[4];
	u32 apftpr;
	u32 mpftpr;
	u32 pftxcntr;
	u32 pfrxcntr;
	u32 pfrtlmtr;
	u32 pfrtcntr;
	u32 reserved19[17];
	u32 macgcr;		/* 0x11b0 */
	u32 bstlmtr;
	u32 reserved20[2];
	u32 umacar;
	u32 reserved21[1];
	u32 lmacar;
	u32 reserved22[77];
	u32 tint1cntr;		/* 0x1300 */
	u32 reserved23[1];
	u32 tint2cntr;
	u32 reserved24[1];
	u32 tint3cntr;
	u32 reserved25[11];
	u32 rint1cntr;
	u32 reserved26[1];
	u32 rint2cntr;
	u32 reserved27[1];
	u32 rint3cntr;
	u32 reserved28[1];
	u32 rint4cntr;
	u32 reserved29[1];
	u32 rint5cntr;
	u32 reserved30[1];
	u32 rint6cntr;
	u32 reserved31[1];
	u32 rint7cntr;
	u32 reserved32[1];
	u32 rint8cntr;
	u32 reserved33[1];
	u32 mdiostsr;
	u32 mdiocmdr;
	u32 mdioadrr;
	u32 mdiodatr;
	u32 mdiocycr;
	u32 reserved34[27];
	u32 desccr;		/* 0x1400 */
	u32 reserved35[3];	/* 0x1404 - 0x1408 */
	u32 dtxspar;
	u32 dtxcpar;
	u32 dtxlpar;
	u32 dtxdlr;
	u32 reserved36[4];
	u32 drxspar;
	u32 drxcpar;
	u32 drxlpar;
	u32 drxdlr;		/* 0x143c */
	u32 reserved37[48];	/* 0x1540 - 0x15dc */
};

#define EMAC_DRDTRG(x)		(((x) << 16) & 0x1ffc0000)
#define EMAC_DRDMSK(x)		((x) & 0x00001ffc)

#define EMACDRENR_DRDEN		0x00000001
#define EMACDRTRGR_DFL		EMAC_DRDTRG(TZ3000_EMAC_BASE + 0x1028)

#define EMACINTR_SERR		0x00000002
#define EMACINTR_DMAINT		0x00000001

#define DMACR_DE		0x00000040
#define DMACR_DL_16		0x00000030
#define DMACR_DL_32		0x00000010
#define DMACR_DL_64		0x00000020
#define DMACR_SWRT		0x00000002
#define DMACR_SWRR		0x00000001

#define DMATXR_START		0x00000003
#define DMATXR_STOP		0x00000000

#define DMARXR_START		0x00000001
#define DMARXR_STOP		0x00000000

#define DMAINTR_ALL		0xff3f07ff
#define DMAINTR_WB1		0x80000000
#define DMAINTR_WB0		0x40000000
#define DMAINTR_FTC1		0x20000000
#define DMAINTR_TUC		0x10000000
#define DMAINTR_ROC		0x08000000
#define DMAINTR_TABT		0x04000000
#define DMAINTR_RABT		0x02000000
#define DMAINTR_RFRMER		0x01000000
#define DMAINTR_MINT		0x00400000
#define DMAINTR_FTC0		0x00200000
